<template>
  <div>
    <div class="container-fluid min-vh-100 text-dark">
      <h2
        id="policy"
        class="mt-5"
      >
        プライバシーポリシー
      </h2>
      <p>
        TriSto（以下，「当方」といいます。）は，本ウェブサイト上で提供する
        サービス（以下,「本サービス」といいます。）における，ユーザーの個人情報の取扱いについて，
        以下のとおりプライバシーポリシー（以下，「本ポリシー」といいます。）を定めます。
      </p>

      <h4>
        第1条（個人情報）
      </h4>
      <p>
        「個人情報」とは，個人情報保護法にいう「個人情報」を指すものとし，
        生存する個人に関する情報であって，当該情報に含まれる氏名，生年月日，住所，電話番号，
        連絡先その他の記述等により特定の個人を識別できる情報及び容貌，指紋，声紋にかかるデータ，
        及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる
        情報（個人識別情報）を指します。
      </p>

      <h4>
        第2条（個人情報の収集方法）
      </h4>
      <p>
        ユーザーが利用登録をする際に、メールアドレスをお尋ねすることがあります。
      </p>

      <h4>
        第3条（個人情報を収集・利用する目的）
      </h4>
      <ol>
        <li>当方サービスの提供・運営のため。</li>
        <li>
          利用規約に違反したユーザーや、不正・不当な目的でサービスを利用しようとする
          ユーザーの特定をし、ご利用をお断りするため。
        </li>
        <li>
          ユーザーにご自身の登録情報の閲覧や変更、削除、ご利用状況の閲覧を行っていただくため。
        </li>
        <li>上記の利用目的に付随する目的。</li>
      </ol>

      <h4>
        第4条（利用目的の変更）
      </h4>
      <p>
        当方は，利用目的が変更前と関連性を有すると合理的に認められる場合に限り，
        個人情報の利用目的を変更するものとします。利用目的の変更を行った場合には，
        変更後の目的について，当方所定の方法により，本ウェブサイト上に公表するものとします。
      </p>

      <h4>
        第5条（個人情報の第三者提供）
      </h4>
      <p>
        第三者に個人情報を提供することはありません。
      </p>

      <h4>
        第6条（個人情報の利用停止等）
      </h4>
      <p>
        当方は，本人から，個人情報が，利用目的の範囲を超えて取り扱われているという理由，
        または不正の手段により取得されたものであるという理由により，
        その利用の停止または消去（以下，「利用停止等」といいます。）を求められた場合には，
        遅滞なく必要な調査を行います。前項の調査結果に基づき，その請求に応じる必要があると
        判断した場合には，遅滞なく，当該個人情報の利用停止等を行います。
        当方は，前項の規定に基づき利用停止等を行った場合，または利用停止等を行わない旨の
        決定をしたときは，遅滞なく，これをユーザーに通知します。前2項にかかわらず，
        利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって，
        ユーザーの権利利益を保護するために必要なこれに代わるべき措置をとれる場合は，
        この代替策を講じるものとします。
      </p>

      <h4>
        第7条（プライバシーポリシーの変更）
      </h4>
      <p>
        本ポリシーの内容は，法令その他本ポリシーに別段の定めのある事項を除いて，
        ユーザーに通知することなく，変更することができるものとします。
        当方が別途定める場合を除いて，変更後のプライバシーポリシーは，
        本ウェブサイトに掲載したときから効力を生じるものとします。
      </p>

      <h4>
        第8条（お問い合わせ窓口）
      </h4>
      <p>
        本ポリシーに関するお問い合わせは，お問い合わせフォームまでお願いいたします。
      </p>

      <template v-if="$mq == 'xs' && authUser">
        <p class="pt-3 text-center end">
          以上
        </p>
      </template>
      <template v-else>
        <p class="pt-3 text-center">
          以上
        </p>
      </template>
    </div>

    <template v-if="$mq == 'lg' || $mq == 'sm'">
      <FooterTermAndPolicy />
    </template>
    <template v-else>
      <FooterTermAndPolicy
        v-if="!authUser"
      />
    </template>
  </div>
</template>

<script>
import FooterTermAndPolicy from '../../components/FooterTermAndPolicy'
import { mapGetters } from 'vuex'

export default {
  name: 'PrivacyPolicy',
  components: {
    FooterTermAndPolicy
  },
  computed: {
    ...mapGetters('users', ['authUser'])
  },
  created() {
    this.scrollTop()
  },
  methods: {
    scrollTop() {
      window.scrollTo({
        top: 0,
        behavior: 'instant'
      })
    }
  }
}
</script>

<style scoped>
.container-fluid {
  max-width: 800px;
}

.end {
  padding-bottom: 100px;
}

h2 {
  font-weight: bold;
}

h4 {
  font-weight: bold;
}

p {
  margin-left: 10px;
}
</style>
