<template>
  <div>
    <div class="container-fluid min-vh-100 text-dark">
      <h2
        id="term"
        class="mt-5"
      >
        利用規約
      </h2>
      <p>
        この利用規約（以下，「本規約」といいます。）は，TriSto（以下，「当方」といいます。）
        がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の
        利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，
        本規約に従って，本サービスをご利用いただきます。
      </p>

      <h4>
        第1条（適用）
      </h4>
      <p>
        本規約は，ユーザーと本サービス提供者との間の本サービスの利用に関わる
        一切の関係に適用されるものとします。
      </p>

      <h4>
        第2条（利用登録）
      </h4>
      <p>
        本サービスにおいては，登録希望者が本規約に同意の上，当方の定める方法によって
        利用登録を申請し，当方がこれを承認することによって，利用登録が完了するものとします。
        当方は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を
        承認しないことがあり，その理由については一切の開示義務を負わないものとします。
      </p>
      <ol>
        <li>利用登録の申請に際して虚偽の事項を届け出た場合</li>
        <li>本規約に違反したことがある者からの申請である場合</li>
        <li>その他，当方が利用登録を相当でないと判断した場合</li>
      </ol>

      <h4>
        第3条（ユーザーIDおよびパスワードの管理）
      </h4>
      <p>
        ユーザーは，自己の責任において，本サービスのユーザーIDおよびパスワードを適切に
        管理するものとします。ユーザーは，いかなる場合にも，ユーザーIDおよびパスワードを
        第三者に譲渡または貸与し，もしくは第三者と共用することはできません。
        当方は，ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には，
        そのユーザーIDを登録しているユーザー自身による利用とみなします。
        ユーザーID及びパスワードが第三者によって使用されたことによって生じた損害や
        トラブルについては，当方は一切の責任を負わないものとします。
      </p>

      <h4>
        第4条（禁止事項）
      </h4>
      <p>
        ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。
      </p>
      <ol>
        <li>法令または公序良俗に違反する行為</li>
        <li>犯罪行為に関連する行為</li>
        <li>
          当方，本サービスの他のユーザー，または第三者のサーバーまたは
          ネットワークの機能を破壊したり，妨害したりする行為
        </li>
        <li>本サービスの運営を妨害するおそれのある行為</li>
        <li>不正アクセスをし，またはこれを試みる行為</li>
        <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
        <li>不正な目的を持って本サービスを利用する行為</li>
        <li>本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為</li>
        <li>他のユーザーに成りすます行為</li>
        <li>当方のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</li>
        <li>その他，当事務局が不適切と判断する行為</li>
      </ol>

      <h4>
        第5条（本サービスの提供の停止等）
      </h4>
      <p>
        当方は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく
        本サービスの全部または一部の提供を停止または中断することができるものとします。
      </p>
      <ol>
        <li>本サービスのシステムの保守点検または更新を行う場合</li>
        <li>
          本サービスが利用するインフラサービスの障害などにより，
          本サービスの提供が困難となった場合
        </li>
        <li>その他，本サービスの提供が困難と判断した場合</li>
      </ol>
      <p>
        本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益
        または損害についても，一切の責任を負わないものとします。
      </p>

      <h4>
        第6条（著作権）
      </h4>
      <p>
        ユーザーは，自ら著作権等の必要な知的財産権を有するか，または必要な権利者の許諾を得た文章，
        画像や映像等の情報に関してのみ，本サービスを利用し，投稿ないしアップロードすることが
        できるものとします。ユーザーが本サービスを利用して投稿ないしアップロードした
        文章，画像，映像等の著作権については，当該ユーザーその他既存の権利者に
        留保されるものとします。ただし，当方は，本サービスを利用して投稿ないしアップロードされた
        文章，画像，映像等について，本サービスの改良，品質の向上，または不備の是正等ならびに
        本サービスの周知宣伝等に必要な範囲で利用できるものとし，ユーザーは，この利用に関して，
        著作者人格権を行使しないものとします。前項本文の定めるものを除き，
        本サービスおよび本サービスに関連する一切の情報についての著作権およびその他の知的財産権は
        すべて当方または当方にその利用を許諾した権利者に帰属し，ユーザーは無断で
        複製，譲渡，貸与，翻訳，改変，転載，公衆送信（送信可能化を含みます。），
        伝送，配布，出版，営業使用等をしてはならないものとします。
      </p>

      <h4>
        第7条（利用制限および登録抹消）
      </h4>
      <p>
        当方は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，投稿データを削除し，
        ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたは
        ユーザーとしての登録を抹消することができるものとします。
      </p>
      <ol>
        <li>本規約のいずれかの条項に違反した場合</li>
        <li>その他，本サービスの利用を適当でないと判断した場合</li>
      </ol>
      <p>
        当方は，本条に基づき行った行為によりユーザーに生じた損害について，一切の責任を負いません。
      </p>

      <h4>
        第8条（免責事項）
      </h4>
      <p>
        本サービスの運営者は，本サービスに関して，ユーザーと他のユーザーまたは
        第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
      </p>

      <h4>
        第9条（退会）
      </h4>
      <p>
        ユーザーは，当方の定める退会手続により，本サービスから退会できるものとします。
      </p>

      <h4>
        第10条（サービス内容の変更等）
      </h4>
      <p>
        本サービス提供者は，ユーザーに通知することなく，本サービスの内容を変更または
        本サービスの提供を中止することができるものとし，これによってユーザーに生じた
        損害について一切の責任を負いません。
      </p>

      <h4>
        第11条（利用規約の変更）
      </h4>
      <p>
        当方は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を
        変更することができるものとします。なお，本規約の変更後，
        本サービスの利用を開始した場合には，当該ユーザーは変更後の規約に同意したものとみなします。
      </p>

      <h4>
        第12条（通知または連絡）
      </h4>
      <p>
        ユーザーと当方との間の通知または連絡は，当方の定める方法によって行うものとします。
        当方は,ユーザーから,当方が別途定める方式に従った変更届け出がない限り,
        現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,
        これらは,発信時にユーザーへ到達したものとみなします。
      </p>

      <h4>
        第13条（権利義務の譲渡の禁止）
      </h4>
      <p>
        ユーザーは，当方の書面による事前の承諾なく，利用契約上の地位または本規約に基づく
        権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
      </p>

      <h4>
        第14条（準拠法・裁判管轄）
      </h4>
      <p>
        本規約の解釈にあたっては，日本法を準拠法とします。本サービスに関して紛争が生じた場合には，
        当方の本店所在地を管轄する裁判所を専属的合意管轄とします。
      </p>

      <template v-if="$mq == 'xs' && authUser">
        <p class="pt-3 text-center end">
          以上
        </p>
      </template>
      <template v-else>
        <p class="pt-3 text-center">
          以上
        </p>
      </template>
    </div>

    <template v-if="$mq == 'lg' || $mq == 'sm'">
      <FooterTermAndPolicy />
    </template>
    <template v-else>
      <FooterTermAndPolicy
        v-if="!authUser"
      />
    </template>
  </div>
</template>

<script>
import FooterTermAndPolicy from '../../components/FooterTermAndPolicy'
import { mapGetters } from 'vuex'

export default {
  name: 'TermOfUse',
  components: {
    FooterTermAndPolicy
  },
  computed: {
    ...mapGetters('users', ['authUser'])
  }
}
</script>

<style scoped>
.container-fluid {
  max-width: 800px;
}

.end {
  padding-bottom: 100px;
}

h2 {
  font-weight: bold;
}

h4 {
  font-weight: bold;
}

p {
  margin-left: 10px;
}
</style>
